
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href='../css/dComp.css'>

    <style>
        span{
            font-size: 16px;
            line-height: 100%;
            font-weight: 400;
        }

        h2{
            color: #8F2247;
            font-size: 20px;
            font-weight: 400;
            margin-bottom: 10px;
        }

    </style>

</head>

<body>
    <section class="droneComp" style="background: #F3F2F2; padding: 45px 60px;">
        <h1 >Компоненты дрона</h1>
        <div style="display: flex">
        <div class="leftSide" >
            <div class="block">
                <h2 >Двигатели</h2>
                <span>Дроны приводятся в движение электродвигателями, которые обеспечивают необходимую тягу для поддержания дрона в воздухе. В большинстве дронов используются бесщеточные двигатели постоянного тока, которые более эффективны и надежны, чем их щеточные аналоги.</span>
            </div>
            <div class="block">
                <h2 >Рама</h2>
                <span>Рама дрона обычно изготавливается из легких и прочных материалов, таких как углеродное волокно или алюминий. Она обеспечивает структуру, к которой крепятся другие компоненты.</span>
            </div>
            <div class="block">
                <h2 >Аккумулятор</h2>
                <span>Дроны питаются от перезаряжаемых литий-ионных батарей, которые обеспечивают необходимую энергию для питания двигателей и других электронных компонентов.</span>
            </div>
        </div>

        <div class="middleSide">

            <img src='../image/Group18.png'>
            <div class="block">
                <h2>Полетный контроллер</h2>
                <span>Полетный контроллер - это мозг дрона. Он получает данные от различных датчиков и управляет двигателями и пропеллерами дрона для поддержания стабильного полета.</span>
            </div>
        </div>

        <div class="rightSide">
            <div class="block">
                <h2>Пропеллеры</h2>
                <span>Пропеллеры прикреплены к двигателям и обеспечивают необходимую подъемную силу для удержания дрона в воздухе. Они обычно изготавливаются из пластика или углеродного волокна и бывают разных размеров в зависимости от размера и веса дрона.</span>
            </div>
            <div class="block">
                <h2>Датчики</h2>
                <span>Дроны оснащены различными датчиками, такими как GPS, акселерометры и гироскопы, которые предоставляют информацию о положении, ориентации и скорости дрона.</span>
            </div>
            <div class="block">
                <h2>Камера</h2>
                <span>Многие дроны оснащены высококачественными камерами, которые могут снимать изображения и видео с уникальных ракурсов.</span>
            </div>
        </div>
            </div>
    </section>
</body>
</html>


